// Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.
// 452 -> 11
// 82 -> 10
// 9012 -> 12
Console.Write("введите число: ");
int a = Convert.ToInt32(Console.ReadLine());
int count = 0;

while(a > 0)
{
    count = count + a % 10;
    a = a / 10;
}
Console.WriteLine(count);

// // 135
// 135 / 10 = 13 
// // 135 % 10 = 5
// 0+5 = 5

// 13 / 10 = 1
// 13 % 10 = 3
// 3+5 = 8

// 1 / 10 = 0
// 1 % 10 = 1
// 8+1 =9